{"/blog/advent-of-code/":{"data":{"":"","#":"This is a collection of my solutions to the Advent of Code challenges. I will be using various languages to solve the challenges. I will be updating this page as I complete more challenges. "},"title":"Advent of Code"},"/blog/advent-of-code/rust/2023/day-1/":{"data":{"":"fn main() { println!(\"Hello, world!\"); } "},"title":"Day 1"},"/blog/projects/":{"data":{"":"This is a collection of projects I’ve worked on. Some are still in development, while others are complete.\nThe projects contain the following information:\nObjective : What the project is trying to achieve\nTools : The tools/technologies used to build the project"},"title":"Projects"},"/blog/projects/book-reader/":{"data":{"":"","#":" ⚠️ This project is still in development Technologies used Tauri A toolkit for building desktop apps with web technologies The backend is made with Rust The frontend is made with Svelte\nIntroduction This project is a book reader that allows you to read books in a variety of formats. It is designed to be easy to use and to provide a pleasant reading experience. The project is still in development and is not ready for use.\nGitHub Prerequisites Knowledge of Rust Knowledge of HTML, CSS and JavaScript or a Framework like Svelte Setup Project Structure Technologies used Steps Conclusion "},"title":"Book Reader"},"/blog/projects/lexer/":{"data":{"":" ⚠️ This project is still in development "},"title":"Lexer"},"/blog/projects/movie-web-app/":{"data":{"":" ⚠️ This project is still in development ","objective#Objective":"The Aim of this project is to create a web application that allows users to search for movies and view them via the web application.","steps#Steps":" 1 This is the first step.\n2 This is the second step.","technologies#Technologies":"Frontend SvelteKit CSS for styling Backend Node.js Database SupaBase API The Movie Database API VidSrc this api is used to get the movie and tv show videos based on their TMDB id. "},"title":"Movie Web App"},"/blog/projects/neural-network/":{"data":{"":"Hello"},"title":"Neural Network"},"/blog/projects/processing-clone/":{"data":{"":" ⚠️ This project is still in development ","description#Description":"This project is a simple attempt to create a processing clone\nIf you havent tried processing check it out at Processing\nAs per the website, Processing is a flexible software sketchbook and a language for learning how to code and was my first introduction to programming in 2021. I used it during university and learnt many fundamnetal concepts such as variables, loops, functions, classes etc.\nYou can create many visual elements and shapes such as squares, lines, texts and basically do stuff with them\nBelow is a GIF of it in action\n🚫 Insert GIF ","how-it-works#How it works":"Processing itself isnt open source so we cant look at the code used to make it. But that doesnt mean we cant figure out how it basically works.\nThe text editor This is the main part of the processing apllication and where you write the code. At the top we can see some buttons, a run and stop button etc\n🚫 Insert Image The Output Window This is the output of what we instructed our code to do. Its the visual stuff\n🚫 Insert Image Interpreter Before our code can actually do something, it needs to be interpreted by another language to create a window with what we want. I dont know what language processing uses but for our clone we will be using Rust.\nbelow is a list of the technologies/tools we will be using\nTechnologies/Tools Tauri - A framework for building tiny, blazingly fast binaries for all major desktop platforms. Frontend : Vanilla JavaScript Backend : Rust MiniFb - A cross platform library written in Rust that makes it easy to setup a window and to display a 32-bit pixel buffer. This will be used to make our graphics window WC Monaco Editor - An easy embed of the Monaco Editor. The Monaco Editor was made by Microsoft and is used by VSCode ","prerequisites#Prerequisites":"We can now start getting our tools\nRust This is the first step.\nTauri This is the second step.\nWC Monaco Editor "},"title":"Processing Clone"},"/blog/projects/resistor-resistance-calculator/":{"data":{"":"","#":" ⚠️ This project is still in development Introduction [GitHub] Prerequisites Setup Project Structure Technologies used Steps Conclusion "},"title":"Resistor Resistance Calculator"}}